Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/tutorial.tmx
Source language: en
Languages: pt

source: Whetting Your Appetite
pt: Abrindo Seu Apetite

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
pt: Se você trabalha muito com computadores, uma hora ou outra vai ver que há algumas tarefas que você queira automatizar. Por exemplo, você pode querer fazer uma busca-e-substituição em um grande número de arquivos, ou renomear e rearrumar uma coleção de fotos de uma maneira complicada. Talvez você queira escrever um pequeno banco de dados customizado, ou uma aplicação com interface de usuário especializada, ou um simples jogo.

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
pt: Se você é um desenvolvedor profissional de software, você pode ter que trabalhar com várias bibliotecas C/C++/Java, mas acha o ciclo escrever/compilar/testar/recompilar muito demorado. Talvez você esteja escrevendo uma suíte de testes para uma biblioteca e acaba achando que escrever códigos de teste é uma tarefa chata. Ou talvez você escreveu um programa que poderia usar uma linguagem de extensão, e não quer ter que refazer o design e implementar uma nova linguagem para sua aplicação.

source: Python is just the language for you.
pt: Python é simplesmente a linguagem para você.

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, Mac OS X, and Unix operating systems, and will help you get the job done more quickly.
pt: Você pode escrever um shell script Unix ou arquivos batch para Windows para algumas tarefas, mas shell scripts são bons para mover arquivos pra lá e pra cá e trocar dados deentro de arquivos de texto, não são tão aplicáveis para aplicações ou jogos com interface gráfica. Você pode escrever um programa em C/C++/Java, mas pode levar muito tempo de desenvolvimento para conseguir um primeiro rascunho do programa. Python é mais simples de usar, disponível em Windows, Mac OS X, e sistemas operacionais Unix, e te ajudará a terminar seu trabalho mais rápido.

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
pt: Python é simples de usar, mas é uma linguagem de programação real, oferecendo muito mais estrutura e suporte a grandes programas do que shell scripts ou arquivos batch podem oferecer. Por outro lado, Python também oferece muito mais checagem de erros que C, e, sendo uma *linguagem de muito alto nível*, já vem com tipos de dados de alto nível, como arrays flexíveis e dicionários. Por causa de seus tipos de dados mais genéricos que Python é aplicável a uma domínio maior de problemas que Awk ou até mesmo Perl, ainda que muitas coisas sejam tão fáceis em Python quanto nestas outras linguagens.

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
pt: Python te permite dividir seu programa em módulos que podem ser reusados em outros programas escritos em Python. A linguagem vem com uma grande coleção de módulos padrões que você pode usar como base para seus programas -- ou como exemplos para começar aprender a programar em Python. Alguns desses módulos provêem coisas como Entrada/Saída, chamadas de sistemas, sockets, e até mesmo interfaces para bibliotecas gráficas como Tk.

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
pt: Python é uma linguagem interpretada, na qual pode te poupar um tempo considerável durante o desenvolvimento de programas porque não é necessário compilar e linkagem. O interpretador pode ser usado interativamente, o que torna fácil experimentar funcionalidades da linguagem, escrever programas que serão jogados fora, ou testar funções durante o início do desenvolvimento do programa. Também é uma calculadora de mesa bem útil.

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
pt: Python permite que programas sejam escritos de forma compacta e legível. Programas escritos em Python são tipicamente muito menores que os equivalentes em C, C++ ou Java, por várias razões:

source: the high-level data types allow you to express complex operations in a single statement;
pt: os tipos de dados de alto nível permitem que você expresse operações complexas em uma única instrução;

source: statement grouping is done by indentation instead of beginning and ending brackets;
pt: agrupamento de instruções é feito por indentação em vez de começar e terminar com chaves;

source: no variable or argument declarations are necessary.
pt: nenhuma declaração de variável ou argumento é necessária.

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
pt: Python é *extensível*: se você sabe programar em C é fácil adicionar uma função interna ou módulo ao interpretador, tanto para realizar operações críticas na velocidade máxima, como para ligar programas Python a bibliotecas que podem estar disponíveis apenas na forma binária (como uma biblioteca gráficas específica de um fabricante). Quando você estiver bem engajado, poderá vincular o interpretador Python em uma aplicação escrita em C e usá-la como linguagem de comandos ou extensão para esta aplicação.

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
pt: A propósito, a linguagem foi batizada a partir do famoso show da BBC "Monty Python's Flying Circus" e não tem nada a ver com répteis. Fazer referências a citações do show Monty Python não é apenas permitido, é encorajado!

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
pt: Agora que você está entusiasmado com Python, vai querer examiná-la em mais detalhes. Desde que a melhor maneira para aprender uma linguagem é unsando-a, o tutorial te convida a brincar com o interpretador a medida que for lendo.

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
pt: No próximo capítulo, os mecanismos de usar o interpretador são explicados. É mais que uma informação mundana, mas essencial para tentar os exemplos mostrados mais tarde.

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
pt: O resto do tutorial apresenta várias funcionalidades do sistema e da linguagem Python através de exemplos, começando com expressões simples, instruções e tipos de dados, através de funções e módulos, e finalmente tocando em conceitos mais avançados como exceções e classes definidas pelo usuário.

source: Python's class mechanism adds classes to the language with a minimum of new syntax and semantics. It is a mixture of the class mechanisms found in C++ and Modula-3. As is true for modules, classes in Python do not put an absolute barrier between definition and user, but rather rely on the politeness of the user not to "break into the definition." The most important features of classes are retained with full power, however: the class inheritance mechanism allows multiple base classes, a derived class can override any methods of its base class or classes, and a method can call the method of a base class with the same name. Objects can contain an arbitrary amount of data.
pt: Mecanismos de classes em Python adicionam classes a linguagem com o mínimo de nova sintaxe e semântica. É uma mistura de mecanismos de classes encontrados em C++ e Modula-3. Assim como é válido para módulos, classes em Python não impõe barreiras entre o usuário e a definição. Contudo, dependem da "cordialidade" do usuário para não quebrar a definição. Todavia, as características mais importantes de classes foram asseguradas: o mecanismo de herança permite múltiplas classes base, uma classe derivada pode sobrescrever quaisquer métodos de uma classe ancestral, e um método pode invocar outro método homônimo de uma classe ancestral. E mais, objetos podem armazenar uma quantidade arbitrária de dados.

source: In C++ terminology, normally class members (including the data members) are *public* (except see below :ref:`tut-private`), and all member functions are *virtual*. As in Modula-3, there are no shorthands for referencing the object's members from its methods: the method function is declared with an explicit first argument representing the object, which is provided implicitly by the call. As in Smalltalk, classes themselves are objects. This provides semantics for importing and renaming. Unlike C++ and Modula-3, built-in types can be used as base classes for extension by the user. Also, like in C++, most built-in operators with special syntax (arithmetic operators, subscripting etc.) can be redefined for class instances.
pt: Na terminologia de C++, membros n de uma classe (incluindo dados) são *public* (exceto veja abaixo :ref:`tut-private`), e todas as funçõesmembras são *virtual*. Como em Modula-3, não existem atalhos para referenciar os membros do objeto de dentro dos seus métodos: o método da função é declarada com um primeiro argumento explícito representando o objeto, que é fornecido implicitamente pela invocação. Como em Smalltalk, classes são objetos. Isso fornece uma semântica para importação e renomeamento. Ao contrário de C++ ou Modula-3, tipos built-in podem ser utilizados como classes base para extensões pelo usuário. Como em C++, a maioria dos operadores pré-definidos com sintaxe especial (operadores aritméticos, subscripting etc.) podem ser redefinidos para instâncias de class.

source: (Lacking universally accepted terminology to talk about classes, I will make occasional use of Smalltalk and C++ terms. I would use Modula-3 terms, since its object-oriented semantics are closer to those of Python than C++, but I expect that few readers have heard of it.)
pt: (Devido à falta de terminologias universais para se falar de classes, eu irei ocasionalmente usar termos de Smalltalk e C++. Eu usaria termos de Modula-3, pois suas semânticas de orientação a objetos são mais próximas das de Python do que C++, mas imagino que poucos leitores estão familiarizados com elas.)

source: A Word About Names and Objects
pt: Uma Palavra Sobre Nomes e Objetos

source: Objects have individuality, and multiple names (in multiple scopes) can be bound to the same object. This is known as aliasing in other languages. This is usually not appreciated on a first glance at Python, and can be safely ignored when dealing with immutable basic types (numbers, strings, tuples). However, aliasing has a possibly surprising effect on the semantics of Python code involving mutable objects such as lists, dictionaries, and most other types. This is usually used to the benefit of the program, since aliases behave like pointers in some respects. For example, passing an object is cheap since only a pointer is passed by the implementation; and if a function modifies an object passed as an argument, the caller will see the change --- this eliminates the need for two different argument passing mechanisms as in Pascal.
pt: Objetos tem individualidade, e podem estar vinculados a múltiplos nomes (em diferentes escopos). Essa facilidade é chamada aliasing em outras linguagens. À primeira vista não é muito apreciada, e pode ser seguramente ignorada ao lidar com tipos imutáveis (números, strings, tuplas). Entretanto, aliasing tem um efeito impressionante sobre a semântica de código em Python envolvendo objetos mutáveis como listas, dicionários, e a maioria dos outros tipos. Isso é comumente usado para beneficio do programa, já que alias se comportam como ponteiros em alguns pontos. Por exemplo, passagem de objetos como parâmetro é barato, pois só o ponteiro é passado na implementação; e se uma função modifica um objeto passado como argumento, quem chamou vai ver a mudança --– isso elimina a necessidade de um duplo mecanismo de passagem de parâmetros como em Pascal.

source: Python Scopes and Namespaces
pt: Escopos e Namespaces em Python

source: Before introducing classes, I first have to tell you something about Python's scope rules. Class definitions play some neat tricks with namespaces, and you need to know how scopes and namespaces work to fully understand what's going on. Incidentally, knowledge about this subject is useful for any advanced Python programmer.
pt: Antes de introduzir classes, é preciso falar das regras de escopo em Python. Definições de classe empregam alguns truques com namespaces e é preciso entender como escopos e namespaces funcionam para entender completamente o que acontece. Esse conhecimento é muito útil para qualquer programador avançado em Python.

source: Let's begin with some definitions.
pt: Vamos começar com algumas definições.

source: A *namespace* is a mapping from names to objects. Most namespaces are currently implemented as Python dictionaries, but that's normally not noticeable in any way (except for performance), and it may change in the future. Examples of namespaces are: the set of built-in names (functions such as :func:`abs`, and built-in exception names); the global names in a module; and the local names in a function invocation. In a sense the set of attributes of an object also form a namespace. The important thing to know about namespaces is that there is absolutely no relation between names in different namespaces; for instance, two different modules may both define a function ``maximize`` without confusion --- users of the modules must prefix it with the module name.
pt: Um *namespace* é um mapeamento entre nomes e objetos. Atualmente a maioria deles são implementados como dicionários, isso não é perceptível (a não ser pelo desempenho), e pode mudar no futuro. Exemplos de namespaces são: o conjunto de nomes pré-definidos (funções como :func:`abs`, e nomes de exceções pré-definidas); nomes globais em módulos; e nomes locais em uma invocação de função. De uma certa forma, os atributos de um objeto também formam um namespace. O que há de importante para saber é que não existe nenhuma relação entre nomes em espaços distintos; por exemplo, dois módulos diferentes podem ambos definir uma função de nome ``maximize`` sem confusão – usuários dos módulos devem prefixar a função com o nome do módulo.

source: By the way, I use the word *attribute* for any name following a dot --- for example, in the expression ``z.real``, ``real`` is an attribute of the object ``z``. Strictly speaking, references to names in modules are attribute references: in the expression ``modname.funcname``, ``modname`` is a module object and ``funcname`` is an attribute of it. In this case there happens to be a straightforward mapping between the module's attributes and the global names defined in the module: they share the same namespace! [#]_
pt: A propósito, eu utilizo a palavra *atributo* para qualquer nome depois de um ponto --- por exemplo, na expressão ``z.real``, ``real`` é um atributo do objeto ``z``. Estritamente falando, referências para nomes em módulos são atributos: na expressão ``modname.funcname``,``modname`` é um objeto módulo e ``funcname`` é seu atributo. Neste caso,existe um mapeamento direto entre os os atributos de um módulo e os nomes globais definidos no módulo: eles compartilham o mesmo namespace! [#]_

source: Attributes may be read-only or writable. In the latter case, assignment to attributes is possible. Module attributes are writable: you can write ``modname.the_answer = 42``. Writable attributes may also be deleted with the :keyword:`del` statement. For example, ``del modname.the_answer`` will remove the attribute :attr:`the_answer` from the object named by ``modname``.
pt: Atributos podem ser somente de leitura ou de escrita. No segundo caso, atribuições são possíveis. Atributos de módulo são de escrita, você pode escrever ``modname.the_answer = 42``. Atributos de escritas também podem ser deletados com o comando :keyword:`del`. Por exemplo ``del modname.the_answer`` irá remover o atributo :attr:`the_answer` do objeto de nome ``modname``.

source: Namespaces are created at different moments and have different lifetimes. The namespace containing the built-in names is created when the Python interpreter starts up, and is never deleted. The global namespace for a module is created when the module definition is read in; normally, module namespaces also last until the interpreter quits. The statements executed by the top-level invocation of the interpreter, either read from a script file or interactively, are considered part of a module called :mod:`__main__`, so they have their own global namespace. (The built-in names actually also live in a module; this is called :mod:`builtins`.)
pt: Namespaces são criados em momentos diferentes e têm diferentes tempos de vida. O namespace contendo os nomes embutidos é criado quando o interpretador Python é iniciado, e nunca é excluído. O namespace global para um módulo é criado quando a definição do módulo é lida; normalmente, namespaces de módulos também persistem até que o interpretador saia. As instruções executadas pela invocação de alto nível do interpretador, sejam lidas por um arquivo de script ou interativamente, são consideradas parte de um módulo chamado :mod:`__main__`, portanto eles têm seus próprios namespaces globais. (Os nomes embutidos também vivem em um módulo; isto é chamado de :mod:`builtins`.)

source: The local namespace for a function is created when the function is called, and deleted when the function returns or raises an exception that is not handled within the function. (Actually, forgetting would be a better way to describe what actually happens.) Of course, recursive invocations each have their own local namespace.
pt: O namespace local de uma função é criado quando a função é chamada, e removido quando a função retorna ou lança uma exceção que não é tratada dentro da função. (Na verdade, esquecer seria uma forma melhor de descrever o que realmente acontece.) Claro, cada uma das invocações recursivas tem seu próprio namespace local.

source: A *scope* is a textual region of a Python program where a namespace is directly accessible. "Directly accessible" here means that an unqualified reference to a name attempts to find the name in the namespace.
pt: "Escopo" é uma região textual de um programa Python em que um namespace é diretamente acessível. "Diretamente acessível" significa, aqui, que uma referência não qualificada para um nome tenta encontrar este nome no namespace.

source: Although scopes are determined statically, they are used dynamically. At any time during execution, there are at least three nested scopes whose namespaces are directly accessible:
pt: Embora escopos sejam determinados estaticamente, eles também são usados dinamicamente. A qualquer momento durante a execução, há pelo menos três escopos aninhados cujos namespaces são diretamente acessíveis:

source: the innermost scope, which is searched first, contains the local names
pt: o escopo mais interno, que é procurado primeiro, contém os nomes locais

source: the scopes of any enclosing functions, which are searched starting with the nearest enclosing scope, contains non-local, but also non-global names
pt: os escopos de quaisquer funções envoltórias, que são buscadas começando pelo escopo envoltório mais próximo, contêm nomes não-locais, mas também nomes não-globais

source: the next-to-last scope contains the current module's global names
pt: o penúltimo escopo contém os nomes globais atuais do módulo

source: the outermost scope (searched last) is the namespace containing built-in names
pt: o escopo mais externo (último a ser pesquisado) é o namespace contendo nomes embutidos

source: If a name is declared global, then all references and assignments go directly to the middle scope containing the module's global names. To rebind variables found outside of the innermost scope, the :keyword:`nonlocal` statement can be used; if not declared nonlocal, those variable are read-only (an attempt to write to such a variable will simply create a *new* local variable in the innermost scope, leaving the identically named outer variable unchanged).
pt: Se um nome é declarado global, então todas as referências e atribuições vão diretamente para o escopo do meio contendo os nomes globais do módulo. Para reatribuir variáveis encontradas no escopo mais interno, a instrução :keyword:`nonlocal` pode ser usada; se declaradas não-locais, estas variáveis são somente-leitura (uma tentativa de gravar tal variável simplesmente criará uma *nova* variável local no escopo mais interno, deixando a variável externa identicamente nomeada inalterada).
